zeabusTeam/zeabus_hydrophone/ZEABUS-STM32-DSP/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2018 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32h7xx_hal.h"
#include "adc.h"
#include "dma.h"
#include "i2c.h"
#include "mdma.h"
#include "tim.h"
#include "usart.h"
#include "usb_device.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include <stdlib.h>
#include "common.h"
#include "abs_threshold.h"
#include "time.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
__SECTION_RAM_D2 uint32_t g_adc1_2_buffer[RAW_DATA_BUFFER_SIZE];
__SECTION_RAM_D2 uint32_t g_adc3_4_buffer[RAW_DATA_BUFFER_SIZE];
__SECTION_AXIRAM uint32_t g_adc_1_h[BUFFER_SIZE];
__SECTION_AXIRAM uint32_t g_adc_2_h[BUFFER_SIZE];
__SECTION_AXIRAM uint32_t g_adc_3_h[BUFFER_SIZE];
__SECTION_AXIRAM uint32_t g_adc_4_h[BUFFER_SIZE];
float32_t g_adc_1_f[BUFFER_SIZE];
float32_t g_adc_2_f[BUFFER_SIZE];
float32_t g_adc_3_f[BUFFER_SIZE];
float32_t g_adc_4_f[BUFFER_SIZE];
float32_t g_filtered_1_f[BUFFER_SIZE];
float32_t g_filtered_2_f[BUFFER_SIZE];
float32_t g_filtered_3_f[BUFFER_SIZE];
float32_t g_filtered_4_f[BUFFER_SIZE];
float32_t g_fft_f32[FFT_SIZE * 2];
float32_t g_fft_f32_out[FFT_SIZE];
int32_t g_adc_offset[4];
uint32_t g_raw_data_index;
uint32_t g_pulse_detect_index;
uint8_t uart_rx_buffer[UART_RX_BUFFER_SIZE];
int g_uart_ready;

// Frequency range of each FFT output datum (i.e. FFT bin size)
const float32_t g_fft_bin_size = SAMPLE_RATE / (float32_t)FFT_SIZE;
const float32_t g_nyquist_rate = SAMPLE_RATE / 2;
const uint16_t g_fir_size = 15; // FIR filter order - 1

// FFT bin index that contains the frequency we are looking for
uint32_t g_desired_fft_bin;
uint32_t g_lowest_considered_fft_bin;
uint32_t g_highest_considered_fft_bin;

// USB Data
InputParam input;
OutputParam output;

// Marked out as it is deprecated
arm_cfft_radix4_instance_f32  FFT_F32_struct;


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

int ADC_Start(){
	if(HAL_ADC_Start_DMA(&hadc1,(uint32_t*)g_adc1_2_buffer,RAW_DATA_BUFFER_SIZE) != HAL_OK){
		  HAL_GPIO_WritePin(GPIOB,GPIO_PIN_14,GPIO_PIN_RESET);
		  // Reset LD3 (RED) if start fail
		  return 0;
	  }

	  if(HAL_ADC_Start_DMA(&hadc3,(uint32_t*)g_adc3_4_buffer,RAW_DATA_BUFFER_SIZE) != HAL_OK){
		  HAL_GPIO_WritePin(GPIOB,GPIO_PIN_14,GPIO_PIN_RESET);
		  // Reset LD3 (RED) if start fail
		  return 0;
	  }

	  return 1;
}

int TIMER_Start(){
	if(HAL_TIM_Base_Start(&htim2) != HAL_OK){
		  HAL_GPIO_WritePin(GPIOB,GPIO_PIN_14,GPIO_PIN_RESET);
		  // Reset LD3 (RED) if start fail
		  return 0;
	 }

	return 1;
}

int Set_LNA_Gain(){

	uint16_t i2c_dev_addr = 0x5C; // MAX 5387 Address
	uint8_t i2c_val[2];
	i2c_val[0] = 0x13; // Set both CH
	i2c_val[1] = (input.LNA_Gain * 255);  // VGain = 1.1 * ( g_i2c_val / 255 )

	// Set gain for channel 1 and 2
	if(HAL_I2C_Master_Transmit(&hi2c1, i2c_dev_addr, i2c_val,2,100) != HAL_OK){
		HAL_GPIO_WritePin(GPIOB,GPIO_PIN_14,GPIO_PIN_RESET);
		// Reset LD3 (RED) if can not set gain value
		return 0;
	}

	// Set gain for channel 3 and 4
	if(HAL_I2C_Master_Transmit(&hi2c1, (i2c_dev_addr + 2), i2c_val,2,100) != HAL_OK){
		HAL_GPIO_WritePin(GPIOB,GPIO_PIN_14,GPIO_PIN_RESET);
		// Reset LD3 (RED) if can not set gain value
		return 0;
	}

	return 1;

