zeabusTeam/zeabus_hydrophone/ZEABUS-STM32-DSP/Src/main.c
}

uint32_t Get_Max_FFT_Bin( float32_t* sig )
{
	float32_t maxVal;
	uint32_t freq_index;
	uint32_t i, k;

	// Translate a part of raw signal data into complex numbers with 0 imaginary magnitude
	k = PULSE_HEADER_SIZE - 1;
	for( i = 0  ; i < FFT_SIZE * 2 ; i += 2 )
	{
		g_fft_f32[ i ] = 0;		// Initialize real part with 0
		g_fft_f32[ i + 1 ] = 0;	// Imaginary part is always 0

		if(k < PULSE_FRAME_SIZE)
		{
			g_fft_f32[ i ] = sig[ k ];
		}
		k++;
	}

	/**** These lines are replaced with "arm_cfft_f32" as they are deprecated
	****/
	// Perform complex FFT over "g_fft_f32". The result is stored back into "g_fft_f32"
	//arm_cfft_radix4_init_f32( &FFT_F32_struct, FFT_SIZE, 0, 1 );
	//arm_cfft_radix4_f32( &FFT_F32_struct, g_fft_f32 );

	// New function to replace 2 functions above
	/* Process the data through the CFFT/CIFFT module with 1024 points */
	arm_cfft_f32( &arm_cfft_sR_f32_len1024, g_fft_f32, 0, 1 );

	/* Process the data through the Complex Magnitude Module for
  		calculating the magnitude at each bin */
	arm_cmplx_mag_f32( g_fft_f32, g_fft_f32_out, FFT_SIZE );

	/* Mask the FFT to only the considered frequency */
	for( i = 0; i < g_lowest_considered_fft_bin; i++ )
		g_fft_f32_out[i] = 0;
	for( i = g_highest_considered_fft_bin; i < FFT_SIZE; i++ )
		g_fft_f32_out[i] = 0;

	/* Looking for the bin that has highest magnitude */
	arm_max_f32( g_fft_f32_out, FFT_SIZE, &maxVal, &freq_index );

	return( freq_index );
}

uint32_t Bin2Freq( uint32_t bin )
{
	float32_t freq;

	freq = (float32_t)(bin) * g_fft_bin_size / 1000.0f; // Frequency in KHz

	float32_t dec;
	float32_t dot = modff(freq, &dec);


	// Rounding the frequency to the nearest 500Hz step (raw frequency is in KHz)
	if( dot >= 0.75f )
	{
		dec = dec + 1.0f;
	}
	else
	{
		if( dot >= 0.25f )
			dec = dec + 0.5f;
	}

	// Convert frequency back to Hz
	freq = dec * 1000.0f;

	return ( (uint32_t)freq );	// Convert the final result to integer
}

void Wait_DMA(DMA_HandleTypeDef *hdma, int eot,int next_round){

	if(next_round == 0){
		while((RAW_DATA_BUFFER_SIZE - (uint16_t)(((DMA_Stream_TypeDef   *)hdma->Instance)->NDTR)) <= eot);
	} else if(next_round == 1) {
		while((uint16_t)(((DMA_Stream_TypeDef   *)hdma->Instance)->NDTR) == 0);
		while((RAW_DATA_BUFFER_SIZE - (uint16_t)(((DMA_Stream_TypeDef   *)hdma->Instance)->NDTR)) <= eot);
	}

}

void Get_Pulse_Frame(){

	 int start_transfer_index = 0;
	 int end_transfer_index = 0;
	 int size_remain = 0;					//size of data that remain to transfer
	 int size_forward_transfer = 0;			//size of data can forward transfer before last address of raw data buffer
	 int next_round = 0;
	 int32_t temp_offset[4] = { 0, 0, 0, 0 };

	 // Case 1 ; some header is at the end of buffer
	 if ((g_pulse_detect_index * 2)  < PULSE_HEADER_SIZE - 1) {
		 size_forward_transfer = PULSE_HEADER_SIZE - (g_pulse_detect_index / 2);
		 start_transfer_index = RAW_DATA_BUFFER_SIZE - (size_forward_transfer * 2); 	// start transfer at bottom of raw data
	 }
	 // Case 2 ; some body is at the next start of buffer
	 else if (((RAW_DATA_BUFFER_SIZE) - (g_pulse_detect_index) - 1) < ((int)PULSE_BODY_SIZE * 2)) {
		 size_forward_transfer = PULSE_HEADER_SIZE + (((int)(RAW_DATA_BUFFER_SIZE) - g_pulse_detect_index ) / 2 ) - 1;
		 start_transfer_index = g_pulse_detect_index - (int)((PULSE_HEADER_SIZE) * 2);
	 }
	 // Case 3 ; all frame is in this buffer length
	 else {
		 size_forward_transfer = (int) PULSE_FRAME_SIZE;
		 start_transfer_index = g_pulse_detect_index - (int)(PULSE_HEADER_SIZE * 2);
	 }

	 size_remain = PULSE_FRAME_SIZE - size_forward_transfer;

	 if (size_remain == 0) {
		 end_transfer_index = start_transfer_index + (int)(PULSE_FRAME_SIZE * 2);
	 }
	 else {
		 end_transfer_index = (size_remain * 2);
	 }

	 Wait_DMA(&hdma_adc1,end_transfer_index,next_round);  		 // wait until frame is fill up

	 HAL_MDMA_Start(&hmdma_mdma_channel0_sw_0,(uint32_t)&g_adc1_2_buffer[start_transfer_index],(uint32_t)&g_adc_1_h,4,size_forward_transfer);
	 HAL_MDMA_Start(&hmdma_mdma_channel1_sw_0,(uint32_t)&g_adc1_2_buffer[start_transfer_index + 1],(uint32_t)&g_adc_2_h,4,size_forward_transfer);
	 HAL_MDMA_Start(&hmdma_mdma_channel2_sw_0,(uint32_t)&g_adc3_4_buffer[start_transfer_index],(uint32_t)&g_adc_3_h,4,size_forward_transfer);
	 HAL_MDMA_Start(&hmdma_mdma_channel3_sw_0,(uint32_t)&g_adc3_4_buffer[start_transfer_index + 1],(uint32_t)&g_adc_4_h,4,size_forward_transfer);

	 HAL_MDMA_PollForTransfer(&hmdma_mdma_channel0_sw_0,HAL_MDMA_FULL_TRANSFER,1000);
	 HAL_MDMA_PollForTransfer(&hmdma_mdma_channel1_sw_0,HAL_MDMA_FULL_TRANSFER,1000);
	 HAL_MDMA_PollForTransfer(&hmdma_mdma_channel2_sw_0,HAL_MDMA_FULL_TRANSFER,1000);
	 HAL_MDMA_PollForTransfer(&hmdma_mdma_channel3_sw_0,HAL_MDMA_FULL_TRANSFER,1000);

	 HAL_MDMA_Abort(&hmdma_mdma_channel0_sw_0);
	 HAL_MDMA_Abort(&hmdma_mdma_channel1_sw_0);
	 HAL_MDMA_Abort(&hmdma_mdma_channel2_sw_0);
	 HAL_MDMA_Abort(&hmdma_mdma_channel3_sw_0);

	 if(size_remain > 0){

		 HAL_MDMA_Start(&hmdma_mdma_channel0_sw_0,(uint32_t)&g_adc1_2_buffer,(uint32_t)&g_adc_1_h[size_forward_transfer],4,size_forward_transfer);
		 HAL_MDMA_Start(&hmdma_mdma_channel1_sw_0,(uint32_t)&g_adc1_2_buffer[1],(uint32_t)&g_adc_2_h[size_forward_transfer],4,size_forward_transfer);
		 HAL_MDMA_Start(&hmdma_mdma_channel2_sw_0,(uint32_t)&g_adc3_4_buffer,(uint32_t)&g_adc_3_h[size_forward_transfer],4,size_forward_transfer);
		 HAL_MDMA_Start(&hmdma_mdma_channel3_sw_0,(uint32_t)&g_adc3_4_buffer[1],(uint32_t)&g_adc_4_h[size_forward_transfer],4,size_forward_transfer);

		 HAL_MDMA_PollForTransfer(&hmdma_mdma_channel0_sw_0,HAL_MDMA_FULL_TRANSFER,1000);
		 HAL_MDMA_PollForTransfer(&hmdma_mdma_channel1_sw_0,HAL_MDMA_FULL_TRANSFER,1000);
		 HAL_MDMA_PollForTransfer(&hmdma_mdma_channel2_sw_0,HAL_MDMA_FULL_TRANSFER,1000);
		 HAL_MDMA_PollForTransfer(&hmdma_mdma_channel3_sw_0,HAL_MDMA_FULL_TRANSFER,1000);

	 	 HAL_MDMA_Abort(&hmdma_mdma_channel0_sw_0);
		 HAL_MDMA_Abort(&hmdma_mdma_channel1_sw_0);
		 HAL_MDMA_Abort(&hmdma_mdma_channel2_sw_0);
		 HAL_MDMA_Abort(&hmdma_mdma_channel3_sw_0);
	 }

