zeabusTeam/zeabus_hydrophone/ZEABUS-STM32-DSP/Src/main.c
	 // Raw ADC data is 16-bit unsigned integer value (0 - 65535 representing 0V - 3.3V)
	 // The following conversion loop convert each datum to floating point format ranging from 0 - 1.0
	 for(int i = 0 ; i < BUFFER_SIZE ; i++) {
		 temp_offset[0] += g_adc_1_h[i];
		 temp_offset[1] += g_adc_2_h[i];
		 temp_offset[2] += g_adc_3_h[i];
		 temp_offset[3] += g_adc_4_h[i];
		/* g_adc_1_f[i] = ADC_NORMALIZE( g_adc_1_h[i], g_adc_offset[0] );
		 g_adc_2_f[i] = ADC_NORMALIZE( g_adc_2_h[i], g_adc_offset[1] );
		 g_adc_3_f[i] = ADC_NORMALIZE( g_adc_3_h[i], g_adc_offset[2] );
		 g_adc_4_f[i] = ADC_NORMALIZE( g_adc_4_h[i], g_adc_offset[3] );
		 */
		 g_adc_1_f[i] = (float32_t)( g_adc_1_h[i] ) / 65535.0f;
		 g_adc_2_f[i] = (float32_t)( g_adc_2_h[i] ) / 65535.0f;
		 g_adc_3_f[i] = (float32_t)( g_adc_3_h[i] ) / 65535.0f;
		 g_adc_4_f[i] = (float32_t)( g_adc_4_h[i] ) / 65535.0f;
	 }

	 // Weighted exponential average of the DC offsets
	 g_adc_offset[0] = (g_adc_offset[0] / 2) + (temp_offset[0] / (BUFFER_SIZE * 2) );
	 g_adc_offset[1] = (g_adc_offset[1] / 2) + (temp_offset[1] / (BUFFER_SIZE * 2) );
	 g_adc_offset[2] = (g_adc_offset[2] / 2) + (temp_offset[2] / (BUFFER_SIZE * 2) );
	 g_adc_offset[3] = (g_adc_offset[3] / 2) + (temp_offset[3] / (BUFFER_SIZE * 2) );
 }

float2bytes f2b;

int UART_Sent(){

	uint8_t uart_tx_buffer[UART_TX_BUFFER_SIZE];
	uint322bytes u32t2b;
	float2bytes f2b;
	int k;

	// Sync
	uart_tx_buffer[0] = 0xFF;
	uart_tx_buffer[1] = 0xFF;

	// Header
	uart_tx_buffer[2] = (char) output.seq_num;
	uart_tx_buffer[3] = (char) output.seq_num >> 8;

	u32t2b.u32t = output.Detect_Frequency;

	uart_tx_buffer[4] = u32t2b.b[0];
	uart_tx_buffer[5] = u32t2b.b[1];
	uart_tx_buffer[6] = u32t2b.b[2];
	uart_tx_buffer[7] = u32t2b.b[3];

	u32t2b.u32t = output.time_between_pulse;

	uart_tx_buffer[8] = u32t2b.b[0];
	uart_tx_buffer[9] = u32t2b.b[1];
	uart_tx_buffer[10] = u32t2b.b[2];
	uart_tx_buffer[11] = u32t2b.b[3];

	u32t2b.u32t = output.process_time;

	uart_tx_buffer[12] = u32t2b.b[0];
	uart_tx_buffer[13] = u32t2b.b[1];
	uart_tx_buffer[14] = u32t2b.b[2];
	uart_tx_buffer[15] = u32t2b.b[3];

	// ==== Data ====
	uart_tx_buffer[16] = 0x11;
	uart_tx_buffer[17] = 0x11;

	k = 18;

	for(int i = 0;i < BUFFER_SIZE ;i++){
		f2b.f = g_adc_1_f[i];
		for(int d = 0;d < 4;d++){
			uart_tx_buffer[k + d] = f2b.b[d];
		}
		k += 4;
	}

	for(int i = 0;i < BUFFER_SIZE ;i++){
			f2b.f = g_adc_2_f[i];
			for(int d = 0;d < 4;d++){
				uart_tx_buffer[k + d] = f2b.b[d];
			}
			k += 4;
		}

	uart_tx_buffer[k] = 0x22;
	k++;
	uart_tx_buffer[k] = 0x22;
	k++;

	for(int i = 0;i < BUFFER_SIZE ;i++){
			f2b.f = g_adc_3_f[i];
			for(int d = 0;d < 4;d++){
				uart_tx_buffer[k + d] = f2b.b[d];
			}
			k += 4;
		}

	for(int i = 0;i < BUFFER_SIZE ;i++){
			f2b.f = g_adc_4_f[i];
			for(int d = 0;d < 4;d++){
				uart_tx_buffer[k + d] = f2b.b[d];
			}
			k += 4;
		}

	uart_tx_buffer[k] = 0x33;
	k++;
	uart_tx_buffer[k] = 0x33;
	k++;

	if(k != UART_TX_BUFFER_SIZE){
		return 0;
	}

//	while(!g_uart_ready);

	g_uart_ready = 0;

	HAL_Delay(10);
	if(HAL_UART_Transmit(&huart3,uart_tx_buffer,UART_TX_BUFFER_SIZE,10000) != HAL_OK){
		return 0;
	}

	LED_BLUE_OFF();

	output.seq_num++;

	return 1;
}

#define FILTER_ORDER	9	// Must be odd number
#define FILTER_BANDWIDTH	2000	// Cut-off offset frequency for the filter
static float32_t g_fir_coefficients[FILTER_ORDER];

/*
algorithm FIR_bandpass filter

Input:
f1, the lowest frequency to be included, in Hz
f2, the highest frequency to be included, in Hz
f_samp, sampling frequency of the audio signal to be filtered, in Hz
N, the order of the filter; assume N is odd

Output:
h, a bandpass FIR filter in the form of an N-element array */
void gen_fir_bandpass( )
{
	float32_t f1_c, f2_c, w1_c, w2_c;
	uint32_t middle;

	//Normalize f_c and ω _c so that pi is equal to the Nyquist angular frequency
	f1_c = ( input.Frequency - FILTER_BANDWIDTH ) / SAMPLE_RATE;
	f2_c = ( input.Frequency + FILTER_BANDWIDTH ) / SAMPLE_RATE;

	// Calculate omega (w) = 2*pi*f
	w1_c = 2 * M_PI * f1_c;
	w2_c = 2 * M_PI * f2_c;

	middle = FILTER_ORDER / 2;    /*Integer division, dropping remainder*/

	for( int i = -middle; i < middle; i++ )
	{
		if ( i == 0 ) // This condition prevents divided-by-zero error
		{
			g_fir_coefficients[ middle ] = 2 * ( f2_c - f1_c );
		}
		else
		{
			g_fir_coefficients[ i + middle ] = ( sin( w2_c * i ) / (M_PI * i ) ) - ( sin( w1_c * i ) / ( M_PI * i ) );
		}
	}
 }

// Apply FIR filter to all stream
void Bandpass_filter()
{
	float32_t fir_state[BUFFER_SIZE + FILTER_ORDER + 1];
	arm_fir_instance_f32 S;

	arm_fir_init_f32( &S, FILTER_ORDER, g_fir_coefficients, fir_state, BUFFER_SIZE );
	arm_fir_f32( &S, g_adc_1_f, g_filtered_1_f, BUFFER_SIZE );
	arm_fir_init_f32( &S, FILTER_ORDER, g_fir_coefficients, fir_state, BUFFER_SIZE );
	arm_fir_f32( &S, g_adc_2_f, g_filtered_2_f, BUFFER_SIZE );
	arm_fir_init_f32( &S, FILTER_ORDER, g_fir_coefficients, fir_state, BUFFER_SIZE );
	arm_fir_f32( &S, g_adc_3_f, g_filtered_3_f, BUFFER_SIZE );
	arm_fir_init_f32( &S, FILTER_ORDER, g_fir_coefficients, fir_state, BUFFER_SIZE );
	arm_fir_f32( &S, g_adc_4_f, g_filtered_4_f, BUFFER_SIZE );
	arm_copy_f32( g_filtered_1_f, g_adc_1_f, BUFFER_SIZE );
	arm_copy_f32( g_filtered_2_f, g_adc_2_f, BUFFER_SIZE );
	arm_copy_f32( g_filtered_3_f, g_adc_3_f, BUFFER_SIZE );
	arm_copy_f32( g_filtered_4_f, g_adc_4_f, BUFFER_SIZE );
}
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	uint32_t frame_bin;
	uint32_t temp_time_stamp;
	uint32_t pulse_time_stamp;
	uint32_t process_time_stamp;

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_MDMA_Init();
  MX_ADC1_Init();
  MX_ADC3_Init();
  MX_I2C1_Init();
  MX_TIM2_Init();
  MX_USART3_UART_Init();
  MX_USB_DEVICE_Init();
  /* USER CODE BEGIN 2 */

  LED_BLUE_ON();
  LED_RED_ON();

  input.MinFrequency = 20000;
  input.MaxFrequency = 45000;
  input.Frequency = 37500;
  //input.FrontThreshold = 0.3;
  //input.PowerThreshold = 0.02;
  input.FrontThreshold = 0.3;
  input.PowerThreshold = 5000;
  input.DelayObserve = 2000;
  input.LNA_Gain = 0.1;

