zeabusTeam/zeabus_hydrophone/ZEABUS-STM32-DSP/Src/main.c
  g_adc_offset[0] = INITIAL_ADC_OFFSET;
  g_adc_offset[1] = INITIAL_ADC_OFFSET;
  g_adc_offset[2] = INITIAL_ADC_OFFSET;
  g_adc_offset[3] = INITIAL_ADC_OFFSET;

  gen_fir_bandpass();

  TIMER_Start(); 	// Start Timer

  ADC_Start();		// Start ADC with DMA

  Set_LNA_Gain();	// Set LNA GAIN

  g_raw_data_index = 0;

  g_desired_fft_bin = (uint32_t)( input.Frequency / g_fft_bin_size ); // Divide and discarding the fraction
  g_lowest_considered_fft_bin = (uint32_t)( input.MinFrequency / g_fft_bin_size ); // Divide and discarding the fraction
  g_highest_considered_fft_bin = (uint32_t)( input.MaxFrequency / g_fft_bin_size ); // Divide and discarding the fraction
  if( g_lowest_considered_fft_bin > g_desired_fft_bin )
	  g_lowest_considered_fft_bin = g_desired_fft_bin;
  if( (g_highest_considered_fft_bin <= g_desired_fft_bin) && (g_desired_fft_bin < FFT_SIZE - 1) )
	  g_lowest_considered_fft_bin = g_desired_fft_bin + 1;

  HAL_UART_Receive_IT(&huart3,uart_rx_buffer,UART_RX_BUFFER_SIZE);

  HAL_Delay(10);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  LED_BLUE_OFF();
  LED_RED_OFF();

  output.seq_num = 0;
  g_uart_ready = 1;
  pulse_time_stamp = 0;


  while (1)
  {

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

	if(abs_threshold_CFAR() == 1)
	{
		temp_time_stamp = HAL_GetTick();
		if(temp_time_stamp - pulse_time_stamp > input.DelayObserve)
		{
			output.time_between_pulse = temp_time_stamp - pulse_time_stamp;
			pulse_time_stamp = temp_time_stamp;
			process_time_stamp = temp_time_stamp;
			Get_Pulse_Frame();
			Bandpass_filter();
			LED_RED_ON();

			frame_bin = Get_Max_FFT_Bin( g_adc_1_f );
			if( g_desired_fft_bin == frame_bin )
			{
				LED_BLUE_ON();	// Turn on blue LED only when frequency matched
			}

			output.Detect_Frequency = Bin2Freq( frame_bin );
			output.process_time = HAL_GetTick() - process_time_stamp;
			UART_Sent();

			LED_RED_OFF();
		}
	}

	g_raw_data_index = g_raw_data_index + 2;

	if(g_raw_data_index > RAW_DATA_BUFFER_SIZE - 2)
	{
		g_raw_data_index = 0;
	}

  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;

    /**Supply configuration update enable 
    */
  MODIFY_REG(PWR->CR3, PWR_CR3_SCUEN, 0);

    /**Configure the main internal regulator output voltage 
    */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  while ((PWR->D3CR & (PWR_D3CR_VOSRDY)) != PWR_D3CR_VOSRDY) 
  {
    
  }
    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI48|RCC_OSCILLATORTYPE_HSI
                              |RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
  RCC_OscInitStruct.HSIState = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.HSI48State = RCC_HSI48_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 100;
  RCC_OscInitStruct.PLL.PLLP = 2;
  RCC_OscInitStruct.PLL.PLLQ = 16;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_3;
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                              |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USART3|RCC_PERIPHCLK_ADC
                              |RCC_PERIPHCLK_I2C1|RCC_PERIPHCLK_USB
                              |RCC_PERIPHCLK_CKPER;
  PeriphClkInitStruct.CkperClockSelection = RCC_CLKPSOURCE_HSI;
  PeriphClkInitStruct.Usart234578ClockSelection = RCC_USART234578CLKSOURCE_D2PCLK1;
  PeriphClkInitStruct.I2c123ClockSelection = RCC_I2C123CLKSOURCE_D2PCLK1;
  PeriphClkInitStruct.UsbClockSelection = RCC_USBCLKSOURCE_HSI48;
  PeriphClkInitStruct.AdcClockSelection = RCC_ADCCLKSOURCE_CLKP;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(SystemCoreClock/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
	if(huart->Instance == USART3){

		  g_uart_ready = 1;
	}
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if(huart->Instance == USART3){
		HAL_GPIO_WritePin(GPIOB,GPIO_PIN_14,GPIO_PIN_SET);
		if(uart_rx_buffer[0] == 61 && uart_rx_buffer[1] == 61 &&
				uart_rx_buffer[2] == 61 && ( uart_rx_buffer[3] == 61  ||  uart_rx_buffer[3] == 63 ))
		{
			uint322bytes u322b;
			float2bytes f2b;

			// Reset code
			if( uart_rx_buffer[3] == 63 )
				NVIC_SystemReset();

			u322b.b[0] = uart_rx_buffer[4];
			u322b.b[1] = uart_rx_buffer[5];
			u322b.b[2] = uart_rx_buffer[6];
			u322b.b[3] = uart_rx_buffer[7];
			input.Frequency = u322b.u32t;

			u322b.b[0] = uart_rx_buffer[8];
			u322b.b[1] = uart_rx_buffer[9];
			u322b.b[2] = uart_rx_buffer[10];
			u322b.b[3] = uart_rx_buffer[11];
			input.MinFrequency = u322b.u32t;

