zeabusTeam/zeabus_hydrophone/ZEABUS-STM32-DSP/Src/main.c
			u322b.b[0] = uart_rx_buffer[12];
			u322b.b[1] = uart_rx_buffer[13];
			u322b.b[2] = uart_rx_buffer[14];
			u322b.b[3] = uart_rx_buffer[15];
			input.MaxFrequency = u322b.u32t;

			f2b.b[0] = uart_rx_buffer[16];
			f2b.b[1] = uart_rx_buffer[17];
			f2b.b[2] = uart_rx_buffer[18];
			f2b.b[3] = uart_rx_buffer[19];
			input.FrontThreshold = f2b.f;

			f2b.b[0] = uart_rx_buffer[20];
			f2b.b[1] = uart_rx_buffer[21];
			f2b.b[2] = uart_rx_buffer[22];
			f2b.b[3] = uart_rx_buffer[23];
			input.PowerThreshold = (uint32_t)(f2b.f * 32767);

			u322b.b[0] = uart_rx_buffer[24];
			u322b.b[1] = uart_rx_buffer[25];
			u322b.b[2] = uart_rx_buffer[26];
			u322b.b[3] = uart_rx_buffer[27];
			input.DelayObserve = u322b.u32t;

			f2b.b[0] = uart_rx_buffer[28];
			f2b.b[1] = uart_rx_buffer[29];
			f2b.b[2] = uart_rx_buffer[30];
			f2b.b[3] = uart_rx_buffer[31];
			input.LNA_Gain = f2b.f;

			Set_LNA_Gain();
			g_desired_fft_bin = (uint32_t)( input.Frequency / g_fft_bin_size ); // Divide and discarding the fraction
			g_lowest_considered_fft_bin = (uint32_t)( input.MinFrequency / g_fft_bin_size ); // Divide and discarding the fraction
			g_highest_considered_fft_bin = (uint32_t)( input.MaxFrequency / g_fft_bin_size ); // Divide and discarding the fraction
			if( g_lowest_considered_fft_bin > g_desired_fft_bin )
				g_lowest_considered_fft_bin = g_desired_fft_bin;
			if( (g_highest_considered_fft_bin <= g_desired_fft_bin) && (g_desired_fft_bin < FFT_SIZE - 1) )
				g_lowest_considered_fft_bin = g_desired_fft_bin + 1;
			gen_fir_bandpass();
		}
		HAL_GPIO_WritePin(GPIOB,GPIO_PIN_14,GPIO_PIN_RESET);
		HAL_UART_Receive_IT(&huart3,uart_rx_buffer,UART_RX_BUFFER_SIZE);
	}

}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
